In [12]:
import pandas as pd

data = pd.read_csv('Domestic violence.csv')

data.head()

   SL. No  Age Education  Employment   Income Marital status  Violence
0       1   30  secondary  unemployed       0         married       yes
1       2   47   tertiary  unemployed       0         married        no
2       3   24   tertiary  unemployed       0        unmarred        no
3       4   22   tertiary  unemployed       0        unmarred        no
4       5   50    primary  unemployed       0         married       yes

In [13]:
data.shape

(347, 7)

In [14]:
data.info()
data.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 347 entries, 0 to 346
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   SL. No           347 non-null    int64
 1   Age              347 non-null    int64
 2   Education        347 non-null    object
 3   Employment       347 non-null    object
 4   Income           347 non-null    int64
 5   Marital status   347 non-null    object
 6   Violence         347 non-null    object
dtypes: int64(3), object(4)
memory usage: 19.1+ KB

Index(['SL. No', 'Age', 'Education ', 'Employment ', 'Income',
       'Marital status ', 'Violence '],
      dtype='object')

In [15]:
data.describe()

           SL. No         Age        Income
count  347.000000  347.000000    347.000000
mean   174.000000   31.380403   2110.685879
std    100.314505    9.601569   5743.278766
min      1.000000   15.000000      0.000000
25%     87.500000   23.000000      0.000000
50%    174.000000   30.000000      0.000000
75%    260.500000   39.500000      0.000000
max    347.000000   60.000000  35000.000000

- see that average age of women is 30, with range being from 15-60
- low average income for women

In [16]:
data["Education "].value_counts()

Education
primary      132
secondary    114
none          52
tertiary      49
Name: count, dtype: int64

- most women do not have an education past primary school, with few having a tertiary education

- Check relationship between income and domestic iolence

In [17]:
data.groupby('Violence ')['Income'].describe()

           count         mean          std  min  25%  50%  75%      max
Violence
no         261.0  2504.628352  6295.998263  0.0  0.0  0.0  0.0  35000.0
yes         86.0   915.116279  3331.084171  0.0  0.0  0.0  0.0  24000.0

- income does not have much impact on violence
- look at maritial status

In [18]:
crossTab = pd.crosstab(data['Marital status '], data['Violence '])
crossTab

Violence          no  yes
Marital status
married          217   83
unmarred          44    3

- seems like married women are more likely to suffer from violence

In [19]:
data['Violence '].value_counts(normalize=True)

Violence
no     0.752161
yes    0.247839
Name: proportion, dtype: float64

- this shows majority of women do not suffer from violence
- now check if these women are emplyed since majority lack education

In [20]:
data['Employment '].value_counts()

Employment
unemployed       274
semi employed     47
employed          23
employed           3
Name: count, dtype: int64

In [21]:
print(data['Employment '].value_counts(normalize=True))

Employment
unemployed       0.789625
semi employed    0.135447
employed         0.066282
employed         0.008646
Name: proportion, dtype: float64